cf/BusinessProcesses/_DemoJobWithRoleAddressing.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<BusinessProcess>
		<Properties>
			<Name>_DemoJobWithRoleAddressing</Name>
			<BasedOn>
				<xr:Item>Catalog.Files</xr:Item>
				<xr:Item>Document._DemoSalesOrder</xr:Item>
				<xr:Item>Catalog.Users</xr:Item>
				<xr:Item>Document._DemoCustomerProformaInvoice</xr:Item>
			</BasedOn>
			<Task>Task.PerformerTask</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalUsers</v8:Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Importance</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TaskImportanceOptions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainTask</Name>
					<Type>
						<v8:Type>cfg:TaskRef.PerformerTask</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaskPerformersGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TaskPerformersGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompletedOn</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalAddressingObject</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.TaskAddressingObjects</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalAddressingObjectSupervisor</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.TaskAddressingObjects</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Performer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalUsers</v8:Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Comment>APK:58 - Task description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LongDesc</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainAddressingObject</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.TaskAddressingObjects</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainAddressingObjectSupervisor</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.TaskAddressingObjects</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubjectOf</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._DemoCustomerProformaInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef._DemoSalesOrder</v8:Type>
						<v8:Type>cfg:CatalogRef.Files</v8:Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckExecution</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Supervisor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PerformerRole</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PerformerRoles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SupervisorRole</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PerformerRoles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BusinessProcessStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaskDueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VerificationDueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaskPerformersGroupSupervisor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TaskPerformersGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AccessValuesSets</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SetNumber</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccessValue</Name>
							<Comment>Empty values must be allowed to avoid errors when writing objects to be checked</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.AccessValue</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Refinement</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Read</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Update</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/Enums/BusinessProcessStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>BusinessProcessStates</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Running</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Suspended</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ExternalUsers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ExternalUsers</Name>
			<Comment>APK:413 - # 744.2.1.1 it is Acceptable not to disable the selection history, since it is used, and the selection redefinition is fixed, that is, service and invalid users will not get into it, but if they somehow got into it, this is not a problem</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Invalid</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AuthorizationObject</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ExternalUser</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SetRolesDirectly</Name>
					<Comment>Used if the "access Control" subsystem is not built in"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prepared</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IBUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteInfobaseUserProperties</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/PerformerRoles.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>PerformerRoles</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UsedWithoutAddressingObjects</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BriefPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UsedByAddressingObjects</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalAddressingObjectTypes</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.TaskAddressingObjects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MainAddressingObjectTypes</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.TaskAddressingObjects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalRole</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeNode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Purpose</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>UsersType</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.User</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/BusinessProcesses/_DemoJobWithRoleAddressing/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.AccessManagement

// Parameters:
//   Table - See AccessManagement.AccessValuesSetsTable
//
Procedure FillAccessValuesSets(Table) Export
	
	// The restriction logic for
	// - "Read": Author OR Performer OR Supervisor OR (SubjectOf AND <assignee or supervisor from addressing>).
	// - "Update": Author.
	//
	// "SubjectOf" (topic) is ignored if the business process has no basis.
	// 
	
	// Read, Update: Set #1.
	String = Table.Add();
	String.SetNumber     = 1;
	String.Read          = True;
	String.Update       = True;
	String.AccessValue = Author;
	
	// Read: Set #2.
	String = Table.Add();
	String.SetNumber     = 2;
	String.Read          = True;
	String.AccessValue = Performer;
	
	// Read: Set #3.
	String = Table.Add();
	String.SetNumber     = 3;
	String.Read          = True;
	String.AccessValue = Supervisor;

	ModuleAccessManagement = Common.CommonModule("AccessManagement");
	If TypeOf(SubjectOf) = Type("CatalogRef.Users") Then
		String = Table.Add();
		String.SetNumber     = 4;
		String.Read          = True;
		String.AccessValue = TaskPerformersGroup;

		String = Table.Add();
		String.SetNumber     = 5;
		String.Read          = True;
		String.AccessValue = TaskPerformersGroupSupervisor;

		String = Table.Add();
		String.SetNumber     = 6;
		String.AccessValue = SubjectOf;

	ElsIf ValueIsFilled(SubjectOf) And ModuleAccessManagement.CanFillAccessValuesSets(SubjectOf) Then

		PerformerAccessGroupSets = AccessManagement.AccessValuesSetsTable();
		String = PerformerAccessGroupSets.Add();
		String.SetNumber     = 1;
		String.Read          = True;
		String.AccessValue = TaskPerformersGroup;

		String = PerformerAccessGroupSets.Add();
		String.SetNumber     = 2;
		String.Read          = True;
		String.AccessValue = TaskPerformersGroupSupervisor;

		SubjectSets = AccessManagement.AccessValuesSetsTable();
		AccessManagement.FillAccessValuesSets(SubjectOf, SubjectSets, Ref);
		SubjectSets = SubjectSets.Copy(SubjectSets.FindRows(New Structure("Read", True)));
		
		// Multiply subject sets by assignee access group sets.
		AccessManagement.AddAccessValuesSets(SubjectSets, PerformerAccessGroupSets, True);
		
		// Append the result to the table of sets.
		AccessManagement.AddAccessValuesSets(Table, SubjectSets);

	Else // Regardless of the subject.
		String = Table.Add();
		String.SetNumber     = 4;
		String.Read          = True;
		String.AccessValue = TaskPerformersGroup;

		String = Table.Add();
		String.SetNumber     = 5;
		String.Read          = True;
		String.AccessValue = TaskPerformersGroupSupervisor;
	EndIf;

EndProcedure

// End StandardSubsystems.AccessManagement

#EndRegion

#EndRegion

#Region EventHandlers

Procedure BeforeWrite(Cancel)

	If DataExchange.Load Then
		Return;
	EndIf;

	BusinessProcessesAndTasksServer.ValidateRightsToChangeBusinessProcessState(ThisObject);

	SetPrivilegedMode(True);
	TaskPerformersGroup = BusinessProcessesAndTasksServer.TaskPerformersGroup(
		PerformerRole, MainAddressingObject, AdditionalAddressingObject);
	TaskPerformersGroupSupervisor = BusinessProcessesAndTasksServer.TaskPerformersGroup(
		SupervisorRole, MainAddressingObjectSupervisor, AdditionalAddressingObjectSupervisor);
	SetPrivilegedMode(False);

EndProcedure

// End StandardSubsystems.AccessManagement

Procedure FillCheckProcessing(Cancel, CheckedAttributes)

	NotCheckedAttributeArray = New Array;
	If AddressingAttributesAreFilled() Then
		NotCheckedAttributeArray.Add("Performer");
	EndIf;
	If Not CheckExecution Or Not SupervisorRole.IsEmpty() Then
		NotCheckedAttributeArray.Add("Supervisor");
	EndIf;
	Common.DeleteNotCheckedAttributesFromArray(CheckedAttributes, NotCheckedAttributeArray);
	
		// When adding a duty, external users can assign it only to a business role.
	If Users.IsExternalUserSession() And InvalidPerformerForExternalUser() Then
		Cancel = True;
	EndIf;

EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)

	If IsNew() Then
		Author = Users.AuthorizedUser();
		TaskDueDate = CurrentSessionDate();
		State = Enums.BusinessProcessStates.Running;
		If TypeOf(FillingData) = Type("CatalogRef.Users") Then
			Performer = FillingData;
		EndIf;
	EndIf;

	If FillingData <> Undefined And TypeOf(FillingData) <> Type("Structure") 
		And FillingData <> Tasks.PerformerTask.EmptyRef() Then
		SubjectOf = FillingData;
	EndIf;

	If TypeOf(FillingData) = Type("DocumentRef._DemoCustomerProformaInvoice") Then
		If Not Users.IsExternalUserSession() 
			And AccessRight("Read", Metadata.Catalogs.ExternalUsers) Then
			FillingProcessingForExternalUser(FillingData);
		EndIf;
		Supervisor = Users.AuthorizedUser();
	EndIf;

	BusinessProcessesAndTasksServer.FillMainTask(ThisObject, FillingData);

EndProcedure

Procedure OnCopy(CopiedObject)

	CompletedOn = '00010101000000';
	State = Enums.BusinessProcessStates.Running;

EndProcedure

////////////////////////////////////////////////////////////////////////////////
// Handlers of flowchart item events.

// Handler of the BeforeTasksCreation event. 
// 
// Parameters:
//  BusinessProcessRoutePoint - BusinessProcessRoutePointRef._DemoJobWithRoleAddressing - The business process route point
//      that hosts the new tasks.
//  TasksBeingFormed - Array of TaskObject.PerformerTask - An array of new tasks.
//  Cancel - Boolean - Flag indicating whether the task addition has been canceled.
//                   If True, tasks will not be written.
// 
Procedure ExecuteWhenCreatingTasks(BusinessProcessRoutePoint, TasksBeingFormed, Cancel)

	If Not AddressingAttributesAreFilled() Then

		Cancel = True;
		Return;

	EndIf;
	
	// Sets addressing attributes and additional attributes for each task.
	For Each Task In TasksBeingFormed Do

		Task.Author = Author;
		Task.Performer = ?(ValueIsFilled(Performer), Performer, Undefined);
		Task.PerformerRole = ?(ValueIsFilled(PerformerRole), PerformerRole, Undefined);
		Task.MainAddressingObject = MainAddressingObject;
		Task.AdditionalAddressingObject = AdditionalAddressingObject;
		Task.Description = Description;
		Task.TaskDueDate = TaskDueDate;
		Task.SubjectOf = SubjectOf;
		Task.LongDesc = LongDesc;

	EndDo;

EndProcedure

Procedure AssignmentToTheExecutorWhenExecuting(BusinessProcessRoutePoint, Task, Cancel)

	If Common.ObjectAttributeValue(Task, "CompletionDate") > CurrentSessionDate() Then
		Common.MessageToUser(
			NStr("ru = 'Фактическая дата выполнения задачи не может быть больше текущей даты.';
				|en = 'The date when the duty is completed cannot be later than today.';"), Task,
			"Object.CompletionDate");
		Cancel = True;
		Return;
	EndIf;

EndProcedure

Procedure CheckTheFulfillmentOfTheConditionCheck(BusinessProcessRoutePoint, Result)
	Result = CheckExecution;
EndProcedure

// Handler of the OnCreateNestedBusinessProcesses event
// 
// Parameters:
//  BusinessProcessRoutePoint - BusinessProcessRoutePointRef._DemoJobWithRoleAddressing - The business process route point
// 	                                                              that hosts the nested business processes.
//  BusinessProcessesBeingFormed - Array of BusinessProcessObject._DemoJobWithRoleAddressing - An array of business processes being created.
//  Cancel - Boolean - Flag indicating whether nested business processes shell not be written and started.
//                   If True, nested business processes will not be written and started.
// 
Procedure CheckWhenCreatingNestedBusinessProcesses(BusinessProcessRoutePoint, BusinessProcessesBeingFormed, Cancel)

	For Each CheckBusinessProcess In BusinessProcessesBeingFormed Do
		CheckBusinessProcess.Performer = Supervisor;
		CheckBusinessProcess.PerformerRole = SupervisorRole;
		CheckBusinessProcess.MainAddressingObject = MainAddressingObjectSupervisor;
		CheckBusinessProcess.AdditionalAddressingObject = AdditionalAddressingObjectSupervisor;
		CheckBusinessProcess.Description = NStr("ru = 'Проверить:';
													|en = 'Revise:';") + " " + Description;
		CheckBusinessProcess.Author = Author;
		CheckBusinessProcess.TaskDueDate = VerificationDueDate;
		CheckBusinessProcess.SubjectOf = SubjectOf;
		CheckBusinessProcess.Write();
	EndDo;

EndProcedure

Procedure CompletionAtCompletion(BusinessProcessRoutePoint, Cancel)

	CompletedOn = BusinessProcessesAndTasksServer.BusinessProcessCompletionDate(Ref);
	Write();

EndProcedure

#EndRegion

#Region Private

Procedure FillingProcessingForExternalUser(Val CustomerProformaInvoice)
	
	Query = New Query(
		"SELECT ALLOWED
		|	ExternalUsers.Ref AS Ref
		|FROM
		|	Catalog.ExternalUsers AS ExternalUsers
		|WHERE
		|	ExternalUsers.AuthorizationObject = &AuthorizationObject");

	Query.SetParameter("AuthorizationObject", Common.ObjectAttributeValue(CustomerProformaInvoice, "Partner"));
	QueryResult = Query.Execute().Select();

	If QueryResult.Next() Then
		Performer = QueryResult.Ref;
	EndIf;

EndProcedure

Function AddressingAttributesAreFilled()

	Return ValueIsFilled(Performer) Or Not PerformerRole.IsEmpty();

EndFunction

Function InvalidPerformerForExternalUser()

	If TypeOf(PerformerRole) = TypeOf(Catalogs.PerformerRoles.EmptyRef()) 
		And Not ValueIsFilled(Performer) Then
		
		AuthorizationObject = ExternalUsers.GetExternalUserAuthorizationObject();
		AuthorizationObjectEmptyRef = Catalogs[AuthorizationObject.Metadata().Name].EmptyRef();

		Query = New Query;
		Query.Text = "SELECT TOP 1
		|	ExecutorRolesAssignment.Ref
		|FROM
		|	Catalog.PerformerRoles.Purpose AS ExecutorRolesAssignment
		|WHERE
		|	ExecutorRolesAssignment.UsersType = &UsersType
		|	AND ExecutorRolesAssignment.Ref = &Ref";

		Query.SetParameter("Ref", PerformerRole);
		Query.SetParameter("UsersType", AuthorizationObjectEmptyRef);

		Return Query.Execute().IsEmpty();
	EndIf;

	Return True;
EndFunction

#EndRegion

#Else
	Raise NStr("ru = 'Недопустимый вызов объекта на клиенте.';
							|en = 'Invalid object call on the client.';");
#EndIf
